In [1]:
sc

In [2]:
spark

In [3]:
people_df = spark.read.json("file:///home/hadoop/Downloads/People.json")

In [6]:
people_df.show(5)

+---------+-----------+----------+------+---+---------+------+
|     city|    country|first_name|gender| id|last_name|salary|
+---------+-----------+----------+------+---+---------+------+
|Mulyosari|  Indonesia|     Valma|Female|  1|     Sans|983107|
|  Niihama|      Japan|     Paolo|  Male|  2|   Kiddie|649173|
|Dū Qal‘ah|Afghanistan|    Miltie|  Male|  3| De Zuani|352898|
|   Iberia|       Peru|    Jarrid|  Male|  4| Dalziell|170398|
| La Ronge|     Canada| Reinaldos|  Male|  5|   Keeffe|440989|
+---------+-----------+----------+------+---+---------+------+
only showing top 5 rows

In [7]:
people_df.printSchema()

root
 |-- city: string (nullable = true)
 |-- country: string (nullable = true)
 |-- first_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- id: long (nullable = true)
 |-- last_name: string (nullable = true)
 |-- salary: long (nullable = true)

#### 1. Create a User Defined Schema for fields of DataFrame.

In [8]:
from pyspark.sql.functions import *
from pyspark.sql.types import IntegerType, FloatType, StringType, StructType, StructField
from pyspark.sql.types import *

In [9]:
schema = StructType([
    StructField("id", IntegerType(), True),
    StructField("first_name", StringType(), True),
    StructField("last_name", StringType(), True),
    StructField("gender", StringType(), True),
    StructField("salary", LongType(), True),
    StructField("city", StringType(), True),
    StructField("country", StringType(), True)
  ])

In [10]:
people_df = spark.read.schema(schema).json("file:///home/hadoop/Downloads/People.json")

In [12]:
people_df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- first_name: string (nullable = true)
 |-- last_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- city: string (nullable = true)
 |-- country: string (nullable = true)

In [13]:
people_df.show()

+---+----------+---------+------+------+------------------+------------+
| id|first_name|last_name|gender|salary|              city|     country|
+---+----------+---------+------+------+------------------+------------+
|  1|     Valma|     Sans|Female|983107|         Mulyosari|   Indonesia|
|  2|     Paolo|   Kiddie|  Male|649173|           Niihama|       Japan|
|  3|    Miltie| De Zuani|  Male|352898|         Dū Qal‘ah| Afghanistan|
|  4|    Jarrid| Dalziell|  Male|170398|            Iberia|        Peru|
|  5| Reinaldos|   Keeffe|  Male|440989|          La Ronge|      Canada|
|  6|        Eb|Schwanden|  Male|274126|      Kuala Lumpur|    Malaysia|
|  7|    Alleyn|   Paddon|  Male|681914|         Al Qurayn|Saudi Arabia|
|  8|   Baryram|     Yell|  Male|250748|           Jixiang|       China|
|  9|     Cammy|     Axel|Female|221750|Thị Trấn Phong Thổ|     Vietnam|
| 10|       Erl|  Caldera|  Male|680801|        Kotatengah|   Indonesia|
| 11|    Miguel|   Moules|  Male|819771|        Roldanillo|    Colombia|
| 12| Mireielle|   Hurley|Female|486029|            Malārd|        Iran|
| 13|    Feodor| Grummitt|  Male|358045|     Fada N'gourma|Burkina Faso|
| 14|     Diana|  Lawfull|Female|397683|           Ciangir|   Indonesia|
| 15|      Evie|   Kaysor|Female|436202|         El Cantón|   Venezuela|
| 16|    Janean|    Sayse|Female|892405|          La Unión|    Colombia|
| 17|     Colan|   Stoppe|  Male|218434|            Xinhua|       China|
| 18|      Erik| Stitcher|  Male|776023|     Крива Паланка|   Macedonia|
| 19|   Sargent|   Cleall|  Male|819269|          Qīr Moāv|      Jordan|
| 20|   Tamqrah|Millichip|Female|313540|      Bogandinskiy|      Russia|
+---+----------+---------+------+------+------------------+------------+
only showing top 20 rows

In [17]:
bank_data = spark.read.json("file:///home/hadoop/Downloads/bank_edited.json", multiLine=True)
bank_data.show(3)

+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+-------+-----+-----+--------+--------+---+
|age|balance|campaign|contact|day|default|duration|education|housing|         job|loan|marital|month|pdays|poutcome|previous|  y|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+-------+-----+-----+--------+--------+---+
| 58|   2143|       1|unknown|  5|     no|     261| tertiary|    yes|  management|  no|married|  may|   -1| unknown|       0| no|
| 44|     29|       1|unknown|  5|     no|     151|secondary|    yes|  technician|  no| single|  may|   -1| unknown|       0| no|
| 33|      2|       1|unknown|  5|     no|      76|secondary|    yes|entrepreneur| yes|married|  may|   -1| unknown|       0| no|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+-------+-----+-----+--------+--------+---+
only showing top 3 rows

In [18]:
bank_data.printSchema()

root
 |-- age: long (nullable = true)
 |-- balance: long (nullable = true)
 |-- campaign: long (nullable = true)
 |-- contact: string (nullable = true)
 |-- day: long (nullable = true)
 |-- default: string (nullable = true)
 |-- duration: long (nullable = true)
 |-- education: string (nullable = true)
 |-- housing: string (nullable = true)
 |-- job: string (nullable = true)
 |-- loan: string (nullable = true)
 |-- marital: string (nullable = true)
 |-- month: string (nullable = true)
 |-- pdays: long (nullable = true)
 |-- poutcome: string (nullable = true)
 |-- previous: long (nullable = true)
 |-- y: string (nullable = true)

#### 2. TypeCasting Any one Column.

In [19]:
# Typecasting age from long to integer.
bank_data.withColumn("age", col("age").cast(IntegerType()))

DataFrame[age: int, balance: bigint, campaign: bigint, contact: string, day: bigint, default: string, duration: bigint, education: string, housing: string, job: string, loan: string, marital: string, month: string, pdays: bigint, poutcome: string, previous: bigint, y: string]

#### 3. Creating New Column from two strings.

In [26]:
from pyspark.sql.functions import concat, lit

people_df.withColumn("Full_Name", concat(col("first_name"), lit(" "), col("last_name"))).show(2)

+---+----------+---------+------+------+---------+---------+------------+
| id|first_name|last_name|gender|salary|     city|  country|   Full_Name|
+---+----------+---------+------+------+---------+---------+------------+
|  1|     Valma|     Sans|Female|983107|Mulyosari|Indonesia|  Valma Sans|
|  2|     Paolo|   Kiddie|  Male|649173|  Niihama|    Japan|Paolo Kiddie|
+---+----------+---------+------+------+---------+---------+------------+
only showing top 2 rows

#### 4. Renaming Existing Column.

In [28]:
people_df = people_df.withColumnRenamed("salary", "income")

In [29]:
people_df

DataFrame[id: int, first_name: string, last_name: string, gender: string, income: bigint, city: string, country: string]

#### 5. Limit()

In [31]:
people_df.limit(5).show()

+---+----------+---------+------+------+---------+-----------+
| id|first_name|last_name|gender|income|     city|    country|
+---+----------+---------+------+------+---------+-----------+
|  1|     Valma|     Sans|Female|983107|Mulyosari|  Indonesia|
|  2|     Paolo|   Kiddie|  Male|649173|  Niihama|      Japan|
|  3|    Miltie| De Zuani|  Male|352898|Dū Qal‘ah|Afghanistan|
|  4|    Jarrid| Dalziell|  Male|170398|   Iberia|       Peru|
|  5| Reinaldos|   Keeffe|  Male|440989| La Ronge|     Canada|
+---+----------+---------+------+------+---------+-----------+

#### 6. OrderBy()
    * Arrange Data in ascending & descending order.

In [34]:
people_df.orderBy(['income'], ascending = True).show(5)

+---+----------+---------+------+------+------------+---------+
| id|first_name|last_name|gender|income|        city|  country|
+---+----------+---------+------+------+------------+---------+
| 93|      Cory|    Prigg|  Male| 12876|     Gondang|Indonesia|
|590|      Flem| Tumielli|  Male| 13347| Debre Zeyit| Ethiopia|
|192|       Odo|  Conyers|  Male| 15555|  Raffingora| Zimbabwe|
|407|  Barbabas|Ballingal|  Male| 18598|Beringinjaya|Indonesia|
|297|     Daron|   Melato|Female| 19881|      Phayao| Thailand|
+---+----------+---------+------+------+------------+---------+
only showing top 5 rows

In [38]:
people_df.orderBy(['country','income'], ascending = [True, False]).show()

+---+----------+------------+------+------+------------------+--------------+
| id|first_name|   last_name|gender|income|              city|       country|
+---+----------+------------+------+------+------------------+--------------+
|490|  Cathlene|    Gatfield|Female|981605|           Mīrābād|   Afghanistan|
|448|      Yuri|     Duggary|  Male|414107|     Sang-e Māshah|   Afghanistan|
|  3|    Miltie|    De Zuani|  Male|352898|         Dū Qal‘ah|   Afghanistan|
|155|    Guntar|    Langmuir|  Male|290613|             Khōst|   Afghanistan|
|983|      Tiff|     Dreakin|Female|208548|             Āsmār|   Afghanistan|
|290|     Myles|      Britch|  Male|191508|         Dū Laīnah|   Afghanistan|
|419|   Ezekiel|   Fleetwood|  Male|163113|      Barakī Barak|   Afghanistan|
|701|    Gerrie|      Heigho|  Male|503327|             Föglö| Aland Islands|
|674|    Ludwig|    Bothwell|  Male|825171|         Martanesh|       Albania|
|421|    Hamnet|     Maruska|  Male|129628|           Hoçisht|       Albania|
|299|     Mordy|      Enrich|  Male|543696|          Fagatogo|American Samoa|
|335|     Golda|     Tesimon|Female|953260|              Uíge|        Angola|
| 98|     Gates|        Cars|Female|866673|              Luau|        Angola|
|872|     Rycca|       Maund|Female|987858|              Azul|     Argentina|
|587|      Cord|      Tuplin|  Male|962743|             Allen|     Argentina|
|707|Hyacinthie|    Robjents|Female|942563| Villa Ojo de Agua|     Argentina|
|285|     Meara|       Musla|Female|915901|            Zapala|     Argentina|
|359|     Patsy|    Dodgshon|  Male|855456|Villa Constitución|     Argentina|
|296|      Anya|   Trowsdall|Female|842606|   28 de Noviembre|     Argentina|
|794|     Alain|Barrowclough|  Male|675649|         Concordia|     Argentina|
+---+----------+------------+------+------+------------------+--------------+
only showing top 20 rows

#### Materialized View
    * createOrReplaceTempView()

In [39]:
bank_data.createOrReplaceTempView('bankdata')

In [41]:
spark.sql("select * from bankdata").show(2)

+---+-------+--------+-------+---+-------+--------+---------+-------+----------+----+-------+-----+-----+--------+--------+---+
|age|balance|campaign|contact|day|default|duration|education|housing|       job|loan|marital|month|pdays|poutcome|previous|  y|
+---+-------+--------+-------+---+-------+--------+---------+-------+----------+----+-------+-----+-----+--------+--------+---+
| 58|   2143|       1|unknown|  5|     no|     261| tertiary|    yes|management|  no|married|  may|   -1| unknown|       0| no|
| 44|     29|       1|unknown|  5|     no|     151|secondary|    yes|technician|  no| single|  may|   -1| unknown|       0| no|
+---+-------+--------+-------+---+-------+--------+---------+-------+----------+----+-------+-----+-----+--------+--------+---+
only showing top 2 rows

In [44]:
spark.sql("select count(*) as count from bankdata").show()

+-----+
|count|
+-----+
|45211|
+-----+

* Show the Top 10 Youngest Age Group Empoyee with Maximum Balance.
* Show the Worst 5 Job Type Having Minimum Salary.